Chapters/Chapter_4/3_moody_H12T18_boxPositionAdjusted_NEW/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "../myVars" //Include global variables

scale   1;

vertices        
(
    ( $x1 $y1 $z1 ) //0
    ( $x2 $y1 $z1 ) //1
    ( $x1 $y2 $z1 ) //2
    ( $x2 $y2 $z1 ) //3
    ( $x1 $y1 $z2 ) //4
    ( $x2 $y1 $z2 ) //5
    ( $x1 $y2 $z2 ) //6
    ( $x2 $y2 $z2 ) //7                   
);

size_0  #calc "($wave_height/$CPH)*pow(2,3)"; // Element size to use for refinement level zero
N_x     #calc "round(fabs($x2-($x1))/$size_0)"; 
N_y     #calc "round(fabs($y2-($y1))/$size_0)";
N_z     #calc "round(fabs($z2-($z1))/$size_0)";

blocks
(   
    hex (0 1 3 2 4 5 7 6) ( $N_x $N_y $N_z )
    //simpleGrading (1 1 1)
    simpleGrading
    (
        (
            (#calc "$inlet_relaxation_length/$domain_length" 0.1 0.5)  // % x-dir, 10% cells, expansion 1/3
            (#calc "$tank_length/$domain_length" 0.6 1) // % x-dir, 60% cells, expansion     
            (#calc "$outlet_relaxation_length/$domain_length" 0.3 2) // % x-dir, 30% cells, expansion 3
        )
        1   // y-direction expansion ratio
        1   // z-direction expansion ratio
    )
);

boundary
(
    bottom
    {
        type patch;
        faces
        (
            (0 1 3 2) //ok
            //(2 6 5 1) // outlet
            //(1 5 4 0) // front
            //(3 7 6 2) // back
            //(0 4 7 3) // inlet
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (0 4 6 2) //ok
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 5 7 3) //ok
        );
    }
    atmosphere
    {
        type patch;
        faces
        (
            (4 5 7 6)//ok
        );
    }
    front
    {
	      type patch;
	      faces
        (
            (2 3 7 6) //ok
        );
    }
    back
    {
	      type wall;
	      faces
        (
            (0 1 5 4) //ok
        );
    }
    //floatingObject
    //{
     //   type wall;
     //   faces ();
    //}
);

mergePatchPairs
(
);

// ************************************************************************* //
