Chapters/Chapter_4/3_moody_H12T18_boxPositionAdjusted_NEW/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.water 0 //BY DEFAULT THE BOX IS FILLED WITH AIR ALPHA=0 IS AIR
);

regions
(
    boxToCell //(xin,yin,zin)(xfin,yfin,zfin)
    {
        box (-100 -100 -100) (100 100 0);
        fieldValues ( volScalarFieldValue alpha.water 1 );
    }

   // boxToCell
   // {
   //     box (0.7 0.8 -100) (100 100 0.65); //THIS IS THE BLOCK OF WATER WHICH IS 0.65 HIGH AND SHOULD CREATE THE WAVES IN THE NWT
   //     fieldValues ( volScalarFieldValue alpha.water 1 );
   // }
);


// ************************************************************************* //
